Tekla.Structures.ModelInternal.Dstv.HeaderOrder
The class used to define the order for Dstv Header using HeaderFields.
If the header is not initialized, it will use the DSTV standard.
HeaderOrder headerOrder = new HeaderOrder();
headerOrder.AddRow(new HeaderRow(HeaderFields.ProjectNumber));
headerOrder.AddRow(new HeaderRow(HeaderFields.DrawingMark));
headerOrder.AddRow(new HeaderRow(HeaderFields.PhaseNumber));
.
.
.
headerOrder.AddRow(new HeaderRow(HeaderFields.InfoText4));
DstvStructure myDstvStructure = new DstvStructure();
myDstvStructure.HeaderOrder = headerOrder;

Tekla.Structures.ModelInternal.Dstv.HeaderOrder.#ctor
Creates a new HeaderOrder instance.

Tekla.Structures.ModelInternal.Dstv.HeaderOrder.#ctor(System.Collections.Generic.List{Tekla.Structures.ModelInternal.Dstv.HeaderRow})
Creates a new HeaderOrder instance using a list of rows as input.

Tekla.Structures.ModelInternal.Dstv.HeaderOrder.AddRow(Tekla.Structures.ModelInternal.Dstv.HeaderRow)
Adds the row to the header order list.

Tekla.Structures.ModelInternal.Dstv.HeaderOrder.DeleteRow(Tekla.Structures.ModelInternal.Dstv.HeaderRow)
Deletes the row from the header order list.

Tekla.Structures.ModelInternal.Dstv.HeaderOrder.DeleteAt(System.Int32)
Deletes a row from the header order list at a specified index.

Tekla.Structures.ModelInternal.Dstv.HeaderOrder.GetRows
Returns the header order list.